MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECG100/mcu.h
extern volatile __AD1CMPEN2bits_t AD1CMPEN2bits __asm__ ("AD1CMPEN2") __attribute__((section("sfrs"), address(0xBF84B030)));
#define AD1CMP2 AD1CMP2
extern volatile uint32_t   AD1CMP2 __attribute__((section("sfrs"), address(0xBF84B034)));
typedef struct {
  uint32_t ADCMPLO:16;
  uint32_t ADCMPHI:16;
} __AD1CMP2bits_t;
extern volatile __AD1CMP2bits_t AD1CMP2bits __asm__ ("AD1CMP2") __attribute__((section("sfrs"), address(0xBF84B034)));
#define AD1CMPEN3 AD1CMPEN3
extern volatile uint32_t   AD1CMPEN3 __attribute__((section("sfrs"), address(0xBF84B038)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __AD1CMPEN3bits_t;
extern volatile __AD1CMPEN3bits_t AD1CMPEN3bits __asm__ ("AD1CMPEN3") __attribute__((section("sfrs"), address(0xBF84B038)));
#define AD1CMP3 AD1CMP3
extern volatile uint32_t   AD1CMP3 __attribute__((section("sfrs"), address(0xBF84B03C)));
typedef struct {
  uint32_t ADCMPLO:16;
  uint32_t ADCMPHI:16;
} __AD1CMP3bits_t;
extern volatile __AD1CMP3bits_t AD1CMP3bits __asm__ ("AD1CMP3") __attribute__((section("sfrs"), address(0xBF84B03C)));
#define AD1CMPEN4 AD1CMPEN4
extern volatile uint32_t   AD1CMPEN4 __attribute__((section("sfrs"), address(0xBF84B040)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __AD1CMPEN4bits_t;
extern volatile __AD1CMPEN4bits_t AD1CMPEN4bits __asm__ ("AD1CMPEN4") __attribute__((section("sfrs"), address(0xBF84B040)));
#define AD1CMP4 AD1CMP4
extern volatile uint32_t   AD1CMP4 __attribute__((section("sfrs"), address(0xBF84B044)));
typedef struct {
  uint32_t ADCMPLO:16;
  uint32_t ADCMPHI:16;
} __AD1CMP4bits_t;
extern volatile __AD1CMP4bits_t AD1CMP4bits __asm__ ("AD1CMP4") __attribute__((section("sfrs"), address(0xBF84B044)));
#define AD1CMPEN5 AD1CMPEN5
extern volatile uint32_t   AD1CMPEN5 __attribute__((section("sfrs"), address(0xBF84B048)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __AD1CMPEN5bits_t;
extern volatile __AD1CMPEN5bits_t AD1CMPEN5bits __asm__ ("AD1CMPEN5") __attribute__((section("sfrs"), address(0xBF84B048)));
#define AD1CMP5 AD1CMP5
extern volatile uint32_t   AD1CMP5 __attribute__((section("sfrs"), address(0xBF84B04C)));
typedef struct {
  uint32_t ADCMPLO:16;
  uint32_t ADCMPHI:16;
} __AD1CMP5bits_t;
extern volatile __AD1CMP5bits_t AD1CMP5bits __asm__ ("AD1CMP5") __attribute__((section("sfrs"), address(0xBF84B04C)));
#define AD1CMPEN6 AD1CMPEN6
extern volatile uint32_t   AD1CMPEN6 __attribute__((section("sfrs"), address(0xBF84B050)));
typedef struct {
  uint32_t CMPE0:1;
  uint32_t CMPE1:1;
  uint32_t CMPE2:1;
  uint32_t CMPE3:1;
  uint32_t CMPE4:1;
  uint32_t CMPE5:1;
  uint32_t CMPE6:1;
  uint32_t CMPE7:1;
  uint32_t CMPE8:1;
  uint32_t CMPE9:1;
  uint32_t CMPE10:1;
  uint32_t CMPE11:1;
  uint32_t CMPE12:1;
  uint32_t CMPE13:1;
  uint32_t CMPE14:1;
  uint32_t CMPE15:1;
  uint32_t CMPE16:1;
  uint32_t CMPE17:1;
  uint32_t CMPE18:1;
  uint32_t CMPE19:1;
  uint32_t CMPE20:1;
  uint32_t CMPE21:1;
  uint32_t CMPE22:1;
  uint32_t CMPE23:1;
  uint32_t CMPE24:1;
  uint32_t CMPE25:1;
  uint32_t CMPE26:1;
  uint32_t CMPE27:1;
  uint32_t CMPE28:1;
  uint32_t CMPE29:1;
  uint32_t CMPE30:1;
  uint32_t CMPE31:1;
} __AD1CMPEN6bits_t;
extern volatile __AD1CMPEN6bits_t AD1CMPEN6bits __asm__ ("AD1CMPEN6") __attribute__((section("sfrs"), address(0xBF84B050)));
#define AD1CMP6 AD1CMP6
extern volatile uint32_t   AD1CMP6 __attribute__((section("sfrs"), address(0xBF84B054)));
typedef struct {
  uint32_t ADCMPLO:16;
  uint32_t ADCMPHI:16;
} __AD1CMP6bits_t;
extern volatile __AD1CMP6bits_t AD1CMP6bits __asm__ ("AD1CMP6") __attribute__((section("sfrs"), address(0xBF84B054)));
#define AD1FLTR1 AD1FLTR1
extern volatile uint32_t   AD1FLTR1 __attribute__((section("sfrs"), address(0xBF84B058)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:6;
  uint32_t :2;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t :2;
  uint32_t AFEN:1;
} __AD1FLTR1bits_t;
extern volatile __AD1FLTR1bits_t AD1FLTR1bits __asm__ ("AD1FLTR1") __attribute__((section("sfrs"), address(0xBF84B058)));
#define AD1FLTR2 AD1FLTR2
extern volatile uint32_t   AD1FLTR2 __attribute__((section("sfrs"), address(0xBF84B05C)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:6;
  uint32_t :2;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t :2;
  uint32_t AFEN:1;
} __AD1FLTR2bits_t;
extern volatile __AD1FLTR2bits_t AD1FLTR2bits __asm__ ("AD1FLTR2") __attribute__((section("sfrs"), address(0xBF84B05C)));
#define AD1FLTR3 AD1FLTR3
extern volatile uint32_t   AD1FLTR3 __attribute__((section("sfrs"), address(0xBF84B060)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:6;
  uint32_t :2;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t :2;
  uint32_t AFEN:1;
} __AD1FLTR3bits_t;
extern volatile __AD1FLTR3bits_t AD1FLTR3bits __asm__ ("AD1FLTR3") __attribute__((section("sfrs"), address(0xBF84B060)));
#define AD1FLTR4 AD1FLTR4
extern volatile uint32_t   AD1FLTR4 __attribute__((section("sfrs"), address(0xBF84B064)));
typedef struct {
  uint32_t FLTRDATA:16;
  uint32_t CHNLID:6;
  uint32_t :2;
  uint32_t AFRDY:1;
  uint32_t AFGIEN:1;
  uint32_t OVRSAM:3;
  uint32_t :2;
  uint32_t AFEN:1;
} __AD1FLTR4bits_t;
